Repository: timsueberkrueb/switch
Catalog: po/*.po
Languages: fr

source: About
fr: À propos

source: A simple game about linear equations
fr: Un jeu simple comportant des équations linéaires

source: Credits
fr: Remerciements

source: Many thanks to <a href='%1'>Andrew Penkrat</a> for his help and contribution ensuring Switch generates systems with one and only one solution 😉.
fr: Merci beaucoup à <a href='%1'>Andrew Penkrat</a> pour son aide et ses contributions afin de s'assurer que Switch génère des systèmes avec une seule et unique solution 😉.

source: Thanks to <a href='%1'>Stuart Langridge</a> for testing, design input and QA.
fr: Merci à <a href='%1'>Stuart Langridge</a> for les tests, la conception et l'assurance qualité.

source: Thanks to <a href='%1'>Sam Hewitt</a> for creating the <a href='%2'>Ubuntu Icon Resource Kit</a> which was used to create the application icon.
fr: Merci à <a href='%1'>Sam Hewitt</a> d'avoir créé le <a href='%2'>Kit de conception d'icônes pour Ubuntu</a> qui a été utilisé pour créer l'icône de l'application.

source: License and Copyright
fr: Licence et copyright

source: Source code available on <a href='%1'>GitHub</a>.
fr: Le code source est disponible sur <a href='%1'>GitHub</a>.

source: Rate
fr: Évaluer

source: Report bug
fr: Signaler une anomalie

source: Contribute
fr: Contribuer

source: Nevermind, moving on!
fr: Qu'à cela ne tienne, continuez[nbsp]!

source: Don't worry!
fr: Ne vous en faites pas[nbsp]!

source: Keep your head up!
fr: Gardez la tête haute[nbsp]!

source: Hold your head up!
fr: Conservez la tête haute[nbsp]!

source: Go on!
fr: Allez[nbsp]!

source: Failure
fr: Échec

source: <b>Your solution</b>: %1
fr: <b>Votre solution</b>[nbsp]: %1

source: <b>Correct solution</b>: %1
fr: <b>La bonne solution</b>[nbsp]: %1

source: Tap anywhere to continue
fr: Appuyez n'importe où pour continuer

source: Back to game
fr: Retour au jeu

source: You made it!
fr: Vous l'avez fait[nbsp]!

source: Thanks so much for playing.
fr: Merci beaucoup d'avoir joué.

source: Help
fr: Aide

source: What is Switch?
fr: Qu'est-ce que Switch[nbsp]?

source: Switch is a game about solving systems of linear equations using the Gaussian elimination of matrices.
fr: Switch est un jeu qui consiste à résoudre des systèmes d'équations linéaires en utilisant l'élimination gaussienne des matrices.

source: WTF?
fr: HEIN[nbsp]?

source: Errrm, yeah 😄
fr: Euuuh, oui 😄

source: Actually, I'm not sure if you can call this 'a game' at all ...
fr: En réalité, je ne suis pas sûr que vous puissiez appeler cela «[nbsp]un jeu[nbsp]»...

source: However, if you're a student and you want to practise the Gaussian elimination algorithm a bit this app can help you.
fr: Cependant, si vous êtes étudiant et que vous voulez réviser un peu la méthode du pivot de Gauss, cette application peut vous aider.

source: You could also see this as a refreshingly different way to prepare for an exam 😉. It's basically up to you to define this app's purpose.
fr: Vous pouvez également voir cette application comme une manière différente et originale de préparer un examen 😉. C'est en fin de compte à vous de définir le but de cette application.

source: Of course, if you're not a student, Switch can still be a good way to train your mathematical skills.
fr: Bien sûr, si vous n'êtes pas étudiant, Switch peut toujours être une bonne manière d'entraîner vos compétences en calcul mental.

source: OMG seriously?! Get me out of here!
fr: Mon dieu, sérieusement[nbsp]?! Je veux sortir d'ici[nbsp]!

source: How does it work?
fr: Comment cela fonctionne-t-il[nbsp]?

source: Show the tutorial
fr: Afficher le tutoriel

source: Spoon boy
fr: Le garçon à la cuillère

source: There is no spoon.
fr: La cuillère n'existe pas.

source: Mouse
fr: La souris

source: So that's why chicken tastes like everything.
fr: C'est donc pour ça que le poulet à le même goût que tout le reste.

source: You need to unplug, man.
fr: Il faut sérieusement que vous vous déconnectiez.

source: Dodge this.
fr: Évite ça.

source: Ignorance is bliss.
fr: Le bonheur, c'est l'ignorance.

source: Our way... or the highway.
fr: Notre voie... ou la voie rapide.

source: The Matrix is everywhere.
fr: La Matrice est partout.

source: Never send a human to do a machine's job.
fr: Ne jamais envoyer un humain faire le travail d'une machine.

source: Neo
fr: Néo

source: Whoa. Déjà vu.
fr: Whoo. Déjà vu.

source: Merovingian
fr: Le Mérovingien

source: I love the French language.
fr: J'adore le Français.

source: Oracle
fr: L'Oracle

source: I love candy.
fr: J'adore les bonbons.

source: The Architect
fr: L'Architecte

source: I've been waiting for you.
fr: Je t'attendais.

source: Level '%1'
fr: Level «[nbsp]%1[nbsp]»

source: Back
fr: Retour

source: Generate new
fr: Regénérer

source: Surrender
fr: Se rendre

source: Solve
fr: Résoudre

source: Stats
fr: Statistiques

source: Locked
fr: Verrouillé

source: Earn all stars in previous levels to unlock.
fr: Obtenez toutes les étoiles dans les niveaux précédents pour déverrouiller.

source: Move the slider to multiply
fr: Déplacez le curseur pour multiplier

source: Hide
fr: Masquer

source: Matrices solved: %1
fr: Matrices résolues[nbsp]: %1

source: Failure count: %1
fr: Nombre d'échecs[nbsp]: %1

source: Success rate: %1%
fr: Taux de réussite[nbsp]: %1

source: Success
fr: Victoire

source: Matrix solved.
fr: Matrice résolue.

source: Solution: %1
fr: Solution[nbsp]: %1

source: Solve %1 more to complete the level.
fr: Résolvez-en encore %1 pour terminer ce niveau.

source: <b>Level '%1' unlocked.</b>
fr: <b>Niveau «[nbsp]%1[nbsp]» déverrouillé.</b>

source: Tutorial
fr: Tutoriel

source: Hey! Welcome to Switch.
fr: Salut[nbsp]! Bienvenue dans Switch.

source: Yeah, I know. That sounds scary. It doesn't really sound like a lot of fun, rather like one of <i>those</i> maths lessons, right? 😉
fr: Oui, je sais. Cela semble effrayant. Cela n'a pas l'air d'être une partie de plaisir, plutôt un de <i>ces</i> cours de maths, n'est-ce pas[nbsp]? 😉

source: ”Then let us hope that I was wrong”
fr: «[nbsp]Espérons que j'ai tort[nbsp]»

source: What is the matrix?
fr: Qu'est-ce que la Matrice[nbsp]?

source: ”The answer is out there, Neo. It's looking for you, and it will find you if you want it to.”
fr: «[nbsp]La réponse est dehors Néo. Elle te cherche et elle te trouvera si tu le souhaites.[nbsp]»

source: The matrices in Switch are matrices of coefficients of associated systems of linear equations. Consider the following linear system:
fr: Les matrices dans Switch sont des matrices de coefficients de systèmes associés d'équations linéaires. Considérons le système linéaire suivant[nbsp]:

source: Now we're removing all the clutter ...
fr: Maintenant, nous retirons tous le bazar...

source: ... and we get a matrix form like the one above.
fr: ...et nous obtenons une forme de matrice comme celle ci-dessus.

source: Solution?
fr: La solution[nbsp]?

source: In Switch, all matrices have exactly one correct solution.
fr: Dans Switch, toutes les matrices ont une seule et unique solution.

source: A solution is an assignment of values to the variables (x, y) such that all equations are correct.
fr: Une solution est une affectation de valeurs aux variables (x, y) afin que toutes les équations soient correctes.

source: In our case the solution x=2, y=1 satisfies the linear system.
fr: Dans notre cas, la solution x=2, y=1 satisfait le système linéaire.

source: How to solve a matrix
fr: Comment résoudre une matrice[nbsp]?

source: There are multiple ways to solve a system of linear equations.
fr: Il y a plusieurs manières de résoudre un système d'équations linéaires.

source: In Switch you will use <a href='https://en.wikipedia.org/wiki/Gaussian_elimination'>Gaussian elimination</a>, also known as row reduction.
fr: Dans Switch, vous utiliserez l'<a href='https://fr.wikipedia.org/wiki/Élimination_de_Gauss-Jordan'>Élimination de Gauss-Jordan</a>, aussi connue sous le nom de méthode du pivot de Gauss.

source: Using the Gaussian elimination algorithm you can perform several actions on a matrix of coefficients.
fr: En utilisant la méthode du pivot de Gauss, vous pouvez effectuer plusieurs actions sur une matrice de coefficients.

source: Those actions are called row operations. In Switch you are able to ...
fr: Ces actions sont appelées opérations élémentaires sur les lignes. Dans Switch, vous pouvez...

source: ... multiply a row by a number
fr: ...multiplier une ligne par un nombre

source: ... add one row to another
fr: ...ajouter une ligne à une autre

source: The goal of all this is to eliminate variables by setting the coefficient to zero. Remember our example:
fr: Le but de tout cela est d'éliminer les variables en rendant le coefficient égal à zéro. Souvenez-vous de notre exemple[nbsp]:

source: To solve this matrix, we would like to eliminate the x variable from the second row.
fr: Pour résoudre cette matrice, nous aimerions éliminer la variable x de la deuxième ligne.

source: To achieve this, we'll multiply the first row by -1 and add it to the second row. The result:
fr: Pour cela, nous allons multiplier la première ligne par -1 et l'ajouter à la seconde ligne. Le résultat[nbsp]:

source: In this simple case, this was the only step needed to solve the system.
fr: Dans ce cas simple, c'était la seule étape nécessaire pour résoudre le système.

source: Our matrix is transformed into upper <a href='https://en.wikipedia.org/wiki/Triangular_matrix'>triangular form</a>, which means that all matix entries below the <a href='https://en.wikipedia.org/wiki/Main_diagonal'>main diagonal</a> are zero.
fr: Notre matrice est transformée en <a href='https://fr.wikipedia.org/wiki/Matrice_triangulaire'>forme triangulaire supérieure</a>, ce qui signifie que toutes les entrées de la matrice sous la <a href='https://fr.wikipedia.org/wiki/Diagonale_principale'>diagonale principale</a> sont nulles.

source: We can now finish solving the matrix in your head:
fr: Nous pouvons maintenant finir de résoudre la matrice de tête[nbsp]:

source: Therefore: x = 2, y = 1
fr: D'où[nbsp]: x = 2, y = 1

source: Alternatively we can continue to simplify the matrix using the row operations ...
fr: Sinon, nous pouvons continuer de simplifier la matrice en utilisant les opérations élémentaires sur les lignes...

source: ... until we end up with the so called reduced <a href='https://en.wikipedia.org/wiki/Row_echelon_form'>row echelon form</a>.
fr: ...jusqu'à ce que nous atteignons ce qu'on appelle la <a href='https://fr.wikipedia.org/wiki/Matrice_%C3%A9chelonn%C3%A9e'>matrice échelonnée</a> réduite.

source: This means that in every row there is exactly one leading coefficient which is 1.
fr: Cela signifie qu'il y a exactement un coefficient pivot égal à 1 dans chaque ligne.

source: All other entries in the same column are 0.
fr: Toutes les autres entrées dans la même colonne sont égales à zéro.

source: And ... action
fr: Et... action

source: In Switch, this all is even more hassle-free. I think it's time to try it yourself.
fr: Dans Switch, tout cela est encore plus aisé. Je pense qu'il est temps d'essayer vous-même.

source: Row operations:
fr: Opérations en ligne[nbsp]:

source: Add
fr: Ajouter

source: • You can drag and drop a row onto another to add it
fr: • Vous pouvez faire un glisser / déposer d'une ligne sur une autre pour l'ajouter

source: Multiply
fr: Multiplier

source: • Tap on a row to select it
fr: • Appuyez sur une ligne pour la sélectionner

source: • The multiply header will show
fr: • Le facteur de multiplication apparaîtra

source: • Hold and move the slider increase/decrease the value of the mutliplicator, release to multiply
fr: • Maintenir appuyé le curseur et le déplacer augmente / diminue la valeur du facteur de multiplication, relâchez-le pour multiplier

source: In Switch, there are two ways to solve a matrix:
fr: Dans Switch, il existe deux façons de résoudre une matrice[nbsp]:

source: 1. Transform the matrix into upper <a href='https://en.wikipedia.org/wiki/Triangular_matrix'>triangular form</a> using the row operations.
fr: 1. Transformer la matrice en <a href='https://fr.wikipedia.org/wiki/Matrice_triangulaire'>forme triangulaire supérieure</a> en utilisant les opérations élémentaires sur les lignes.

source: Click on the 'Solve' button when you think you know the solution.
fr: Cliquez sur le bouton «[nbsp]Résoudre[nbsp] lorsque vous pensez avoir la solution.

source: ⊕ time efficient for small matrices
fr: ⊕ efficace pour les petites matrices

source: ⊕ train your mental arithmetic skills
fr: ⊕ exerce vos compétences en calcul mental

source: ⊖ difficult for bigger matrices
fr: ⊖ difficile pour de plus grosses matrices

source: ↳ recommended for smaller matrices
fr: ↳ recommandé pour les petites matrices

source: 2. Simplify the matrix as much as possible by using the row operations.
fr: 2. Simplifiez autant que possible la matrice en utilisant les opérations élémentaires sur les lignes.

source: You will end up with the so called reduced <a href='https://en.wikipedia.org/wiki/Row_echelon_form'>row echelon form</a> and Switch will detect that the matrix is solved.
fr: Vous finirez avec ce que l'on appelle la <a href='https://fr.wikipedia.org/wiki/Matrice_%C3%A9chelonn%C3%A9e'>matrice échelonnée</a> réduite et Switch détectera que la matrice est résolue.

source: ⊕ easy on the brain (no need for mental arithmetic)
fr: ⊕ Reposant (pas besoin de calcul mental)

source: ⊖ wastefully time consuming for smaller matrices
fr: ⊖ inutilement chronophage pour les matrices les plus petites

source: ↳ recommended for big matrices
fr: ↳ recommandé pour les grosses matrices

source: ”The problem is choice.”
fr: «[nbsp]Le problème, c'est le choix.[nbsp]»

source: – <i>Neo</i>
fr: – <i>Néo</i>

source: Let's go
fr: Allons-y

source: I think it's time to try it yourself.
fr: Je pense qu'il est temps d'essayer vous-même.

source: As soon as you think you got it, you can <a href='#'>check your solution</a>.
fr: Dès que vous pensez avoir le résultat, vous pouvez <a href='#'>vérifier votre solution</a>.

source: Or, alternatively, simplify it to the very end and Switch will handle the rest.
fr: Ou sinon, simplifiez la matrice à l'extrême et Switch gérera le reste.

source: <u>Hint:</u> The variables in Switch are called X1, X2, X3 ... XN (e.g. instead of x, y, z).
fr: <u>Astuce[nbsp]:</u> Les variables dans Switch sont appelées X1, X2, X3 ... XN (par ex. au lieu de x, y, z).

source: The reason for this is simply that there will be more than just 3 variables in the game and this naming scheme is more consistent therefore.
fr: La raison de cela vient simplement du fait qu'il y aura plus de 3 variables dans le jeu et que cette stratégie de notation est plus cohérente dans ce cas.

source: No idea what to do? <a href='#'>Go back to the explanations</a>.
fr: Aucune idée sur quoi faire[nbsp]? <a href='#'>Revenez aux explications</a>.

source: Success!
fr: Victoire[nbsp]!

source: Are you ready for more?
fr: Êtes-vous prêt pour aller plus loin[nbsp]?

source: Continue
fr: Continuer

source: This is not the correct solution. Try again!
fr: Ce n'est pas la bonne solution. Réessayez[nbsp]!
